Autodesk.Revit.DB.View.GetModelToProjectionTransforms
Gets the transforms from model space to the view projection space.
Remarks:
Model space is the global 3D coordinate space in which the geometry
of the model lives.
View projection space is the 3D Euclidean space with a coordinate system such that
X and Y are horizontal and vertical directions in the view projection plane and Z
is the cross product of X and Y. Distances in the projection space are the same as
would be measured on paper if the view is printed without additional scaling.
Most views will return just one Autodesk.Revit.DB.TransformWithBoundary.  The exceptions are
views with split crop regions.  Split crop regions can be independently moved and therefore
each region of a split crop gets its own transform and boundary.  You can check if a view has split crop
regions by getting the Autodesk.Revit.DB.ViewCropRegionShapeManager and calling ViewCropRegionShapeManager.IsSplit().
When the view's crop region is split, many TransformWithBoundary objects will be returned.
Each TransformWithBoundary corresponds to one region of the split crop. To determine which
TransformWithBoundary to use when converting a model point into view projection space,
first test to see which split crop region boundary contains the model point.
See TransformWithBoundary.GetBoundary().
Returns:
The transformations from model space to view projection space.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view does not return transforms.
-or-
The view is a perspective view.
Since:
2020.1

Autodesk.Revit.DB.View.HasViewTransforms
Returns true if the view reports model space to view projection space transforms.
Remarks:
Not all views return transforms.  For example, schedules and legends
do not report transforms.
Returns:
True if the view returns transforms, false otherwise.
Since:
2020.1